frontend/controllers/SiteController.php

    public function actionIndex()
    {
        $page = Yii::$app->sr->record->getStaticPage('home', true);

        $cats = ProductCategory::find()->all();
---
SELECT * FROM `ProductCategory`