common/components/Settings.php

    public function init()
    {
        parent::init();
        $this->_attributes = ArrayHelper::map(SystemSettings::find()->select(['name', 'value'])->asArray()->all(), 'name', 'value');
---
SELECT `name`, `value` FROM `SystemSettings`