frontend/views/layouts/main.php

SELECT * FROM `Menu` WHERE `id`=1
---

$user = Yii::$app->user->identity;
$langs = Yii::$app->i18n->getLanguages(true);
$menu = Menu::findOne(1)->setJsonAttributes(['url'])->tree();