common/helpers/SpeedRunner/Record.php

    public function staticpage($location)
    {
        $result['page'] = Staticpage::find()->with(['blocks'])->where(['location' => $location])->one();
---
SELECT * FROM `StaticPage` WHERE `location`='home'