common/helpers/SpeedRunner/Seo.php

    public function getMeta($model)
    {
        $model_class = basename($model->className());

        $seo_meta_mdl = SeoMeta::find()
            ->andWhere([
                'model_class' => $model_class,
                'model_id' => $model->id,
                'lang' => Yii::$app->language
            ])
            ->one();
---
SELECT * FROM `SeoMeta` WHERE (`model_class`='StaticPage') AND (`model_id`=15) AND (`lang`='en')